{
  "data": [
    {
      "id": 17,
      "title": "How To Throw the Perfect NYE House Party?",
      "background": "https://imgix.bustle.com/uploads/image/2017/12/4/8f6e40a9-0066-4495-a28b-107812916b70-fotolia_144839595_subscription_monthly_m.jpg?w=800&fit=crop&crop=faces&auto=format%2Ccompress",
      "highlight": "<p>Volunteering to throw a house party on New Year’s Eve? Want to make your party one about which is remembered by your friends & family for a really long time? Then read along.</p>",
      "text": "<p>It’s that time of the year finally, when everyone is excited to leave behind the year that has ended and to welcome the new year hoping to fulfil all our wishes and dreams. But why throw a stay-at-home party when you could go out? Because there's always a certain amount of pressure surrounding New Year's Eve plans. For one, everyone wants to start the New Year off with a bang (with champagne & a memorable photo of them when the ball finally drops at midnight, that is), and second, you're usually required to make arrangements well in advance since even the most casual bars can require you to purchase tickets or commit to a spending minimum ahead of time. And while we appreciate the typical celebrations that welcome the new calendar year, hitting the town can come with a bit of stress involving transportation, expenses like fixed price menus and ticket parties, and general inconveniences like road closures, long bathroom lines, missing out on live coverage etc. that can create a more stressful environment than a celebratory one. But most of all, with the ongoing pandemic and the rising infection rates, it has become more dangerous to enter crowded places as you and your friends face the risk of contracting the infection when all you want is to have some fun on NYE. This has also lead to the government imposing strict lockdowns and anti-crowding regulations in certain areas which can make going out to enjoy nay impossible.</p><p>That being said, you can always host an at-home NYE party that is cost-efficient, cosy, convenient. Plus, it will save you and your company from the aforementioned dilemmas that are inevitable with the big night out—no matter where you live. Whether it's a formal dinner party or a casual \"curl up on the couch\" kind of gathering, we've got the best tips for throwing a memorable and, most importantly, festive bash from the comfort of your own home.</p><ol><li><h4>Get everyone involved with a theme</h4><p>If you're hosting a larger group, invite everyone to get involved by establishing a theme for the party in advance. Whether it’s black and gold attire, or a totally ’80s NYE, costumes upgrade an otherwise standard NYE bash, and create memories (i.e., photos) to take into the new year. Opt for a clear, realistic theme that you know guests will be able to execute. Make sure to list the theme on your invitation, or even make the invite itself themed. While party hats, streamers, and other trinkets can sometimes translate as tacky, the opposite is true on New Year's Eve. Get everyone in the mood for a group countdown by passing out hats, horns, sunglasses, and any other accessories that will lend a festive feel to the evening while also sticking to the theme. New Year's party items are extremely easy to find and order online, and it makes for memorable photos when everyone gets to take part in the fun attire. If you'd rather not go full-on for expense or clean-up purposes, pick up some sparkling drink stirrers or any other décor item (a small disco ball, sparklers, etc.) that will make the party atmosphere festive without requiring the participation of each guest.</p></li><li><h4>Create An Attractive Ambiance</h4><p> You're not just throwing any party on NYE, so set the tone by creating the right environment for your party-goers to both get comfortable and let the good times roll. Since the sun sets much earlier this time of year, embrace the dim lighting and fill the room with the soft glow of votive candles, twinkle lights, or a cozy fire. Designate your space to make your friends and family well-aware of the party zones in your home (they'll take the hint as to what is off-limits) by setting up the room(s) with drink stations, appetizers, and plenty of seating. Be sure to take coats and other items from your guests so the party area is not cluttered with unnecessary objects and to leave more room for relaxing, dancing, or partaking in the festivities. By simply achieving an attractive ambiance, the party will be an instant success. Rather than you having to play mixologist all evening, get your guests in on the drink glamification with a DIY garnish bar. Set up a platter of items like citrus slices, berries, olives, cocktail syrup, rosemary springs, cinnamon sticks, and swizzle sticks so that guests can accessorize their SOLO cup. Feel free to tailor the garnishes to your theme if that feels right -- like neon-colored plastic umbrellas and edible flowers for a beach-themed party. This is also a fun way to prevent people from accidentally picking up the wrong cup (because no one likes realizing they have someone else’s drink by noticing a lipstick stain halfway through a sip). Stack and order tracks based on tempo and mood to flow throughout the night -- so by the time the clock strikes midnight, everyone’s ready for something that gets everyone dancing or a great classic sing-a-long. If you’re having trouble thinking of music that will please everyone, crowdsource songs with friends a few days before the party by asking them to send you their favourite playlists so you can pick and choose what you like.</p></li><li><h4>Have Multiple Activities Planned in Advance</h4><p>Since NYE parties typically tend to last longer (starting at cocktail hour and waiting for the ball to drop), break up the monotony of the party by planning a few fun activities. Set up games (like backgammon, dice, or cards) and station them around the room for appetizer hour, which will give your guests an inclusive activity to focus on before dinner. Encouraging everyone to participate in a game is an easy way to kick off the evening -- or revive the party if the energy is dwindling. It’s also a fun way to bond with your friends or help them mingle with guests they haven’t met before. Choose games that will leave people laughing (and don’t require much explanation) so that everyone can feel included. For big groups, Password or Never Have I Ever are both easy crowd-pleasers. Leave out your favourite board games and a deck of cards -- on a side table -- so that guests can spontaneously start playing in smaller groups if they want to. This way, no one feels forced to play a laborious game of Monopoly and they’ll be out of the way of other people who are about to enter the extremely intense dancing phase of the night. Plan another more festive break to have everyone write down their resolutions (and guess who belongs to which resolution) or a prediction for the New Year. Rather than forcing everyone to wait for something to happen, you'll have plenty of fun in store to keep the party going all night (or at least until midnight).</p></li><li><h4>Pace the Drinks and Appetizers</h4><p>Just like a good party, appetizers should also have a beginning, middle, and end. Whether you've decided to host a sit-down dinner or hearty bites, choose a menu that your guests will remember—for being both delicious and creative. Make sure to have light, cold appetizers already prepped and arranged next to a stack of SOLO plates when guests arrive. Then, the middle of the party is when it’s time to serve hearty options like spicy meatballs or choose an easy one-pot entrée that will allow you to enjoy the party without spending the night in the kitchen. No one will say no to a wonderful chili or a family roast recipe, and it keeps the kitchen clean up easy for everyone. Your company will feel more welcome (and most likely have way more fun) if the beverages are plentiful and easily accessible. Set out pre-poured flutes of champagne for the time of arrival and replenish bottles for refills around the time the ball drops. Create a signature batch cocktail that you can serve from a large carafe and set out wine, beer, and glasses so your guests can help themselves. Don’t forget about serving late-night snacks too. </p><p>It's important to keep everyone hydrated, so be sure to provide ample water (and sparkling water) as well. Self-serve stations can be better for house parties as to avoid crowds forming around a bar or in a certain room. By allowing guests to refill themselves whenever they want, they'll be happy (tipsy), and you'll save money you'd be paying at an hourly rate for a bartender.</p></li><li><h4>Give Guests Mementos to Take Home</h4><p>When the midnight approaches, amd everyone has finished with socialising, drinking, eating & writing New Year’s resolutions, you can turn up the TV’s volume to count down to the arrival of the next year in excitement. Sure, everyone has a camera phone, but your guests will still love a physical, take-home photo they can hold. An instant camera makes for a fun way to document the night and create take-home keepsakes -- and also (hopefully) encourages people to stay off their phones and enjoy the party. You can even create your own staged photo area by glamming up a wall with a festive backdrop, like plenty of colourful balloons. Now, your New Year’s Eve party will be immortalized on your friends' refrigerators well into the New Year.</p></li></ol><h4>Conclusion</h4><p>While the overall atmosphere, food, and drinks are a huge part of hosting a successful bash, the small details never go unnoticed by your guests. Perhaps it's as simple as passing out shot-glasses of mouthwash before the clock strikes midnight (everyone wants to be fresh for their NYE kiss) or planning a customized playlist, all of these small instances will go a long way with your guests. And this is how anyone can take their NYE party from average to unforgettable. But worry not if you can deal with these hassles yourselves! Just give us a call & we’ll take care of all of it for you. </p>"
    },
    {
      "id": 16,
      "title": "Decorations in Indian Weddings",
      "background": "https://cdn0.weddingwire.in/articles/images/8/8/2/6/img_26288/r10_2x_wedding-decor-mistakes-atisuto-lead-image.jpg",
      "highlight": "<p>Decorations play a vital role in making a wedding memorable for everyone attending. This blog will give you a general idea about the 'what' and 'how' of decorations in an Indian wedding and how spending that 'little extra' on the decorations can make the wedding a memorable experience for all the attendees as well as the organizers.</p>",
      "text": "<h4>Why Wedding decoration is so important Indian Weddings?</h4><p>An Indian wedding is a grand event and therefore, everything has to be executed with grandeur, finesse and opulence in mind, and \"Wedding Decoration\" plays a major role in making a wedding the \"Dream Wedding\". Wedding ceremonies are always filled with laughter and joy. They are harmonious events as they are the coming together of not just two people, but also two different families. To that affect, while adorning the venue and making it shine bright, detailing is kept in mind with nothing left out of place.</p></br><img src=\"https://www.manhattanbride.com/wp-content/uploads/2019/04/Indian-Traditions39-563-Damion-Edwards-Photography.jpg\" class=\"col-sm-12\"></br><p>Whether you are a minimalist and you want a simple wedding or an elaborate affair, it's all up to you. There are decoration designs that appeal to your taste and liking, and how far you want to go depending on your budget. There are different Indian wedding decorations to choose from, but most Indian wedding ceremonies are famous for theme-based decorations. Here the bride's wedding outfit is designed based on the color of the decorations she has selected. This gives the ceremony an extra touch of beauty. Most Indian wedding decorations and other aspects of the wedding are based on the bride, her family, and sometimes friends. Other than this, Indian wedding ceremonies are incomplete without certain rituals. These rituals are necessary for the wedding to take place, and they sometimes influence the choice of the wedding decorations. The venue also is a crucial factor which decides how decoration is handled at a wedding. Let us see how decorations are done in a big fat Indian wedding.</p><u><h4>The stage decoration - Epicenter of photography</h4></u></br><img src=\"https://www.brides.com/thmb/7qRnktS9-VeofAkpaGV1jllskQ0=/1200x799/filters:no_upscale():max_bytes(150000):strip_icc()/Indian-wedding-ceremony-2e4c6334ca2948e0977f622e68dacb72.jpg\" class=\"col-sm-12\"></br><p>The stage is the focal point of the wedding whether it is the ceremony or the reception. Hence, the stage backdrop needs to be decorated with extra attention to detail. There are various ways to decorate your wedding stage backdrop. You could go with a particular color scheme, have a particular theme, or a small set-up to set the tone of the event. Having a good stage backdrop is very important, especially for wedding photographers. It creates an ideal background for your beautiful wedding pictures. Stage backdrops come in different designs depending on what you want or what are you looking for and you have all the rights to make it unique or go overboard with your choices as it's your own big fat Indian wedding after all.</p><h4>Outdoor or Open Area stage décor</h4></br><img src=\"https://www.theknot.com/tk-media/images/ef9a59a9-89d3-40e0-b0ac-0f562c148950\" class=\"col-sm-12\"></br><p>It’s very common in summers to go for day weddings since you can use the natural sunlight and also can save the cost by having your stage setup out in the open lawn. It looks stunning when done right!</p></br><img src=\"https://i.ytimg.com/vi/dLjrs7jWJkU/maxresdefault.jpg\" class=\"col-sm-12\"></br><p>Look at this beautiful stage decor in Indian wedding. It would perfectly go for a \"Roka ceremony\" and when you are doing a destination wedding this can be used for \"Sangeet\" as well.</p><hr><h4>Fabric Backdrop</h4><p>Fabric drapes are used to create classy and elegant stage backdrops. There are different options of fabrics that can be used ranging from chiffon to silk, or satin. This backdrop can offer a very artistic and beautiful effect to the entire decorative setup. If you already have a color scheme for the wedding, then this backdrop can be made to match the scheme.</p></br><img src=\"https://5.imimg.com/data5/HL/LL/EJ/SELLER-4174837/wedding-reception-stage-decoration-ideas14-500x500.jpg\" class=\"col-sm-12\"></br><p>These drapes come in different colors and design patterns, and you could make use of one or more colors and designs for your wedding. It is important to complement the stage with items that match the theme of the wedding so it doesn't look bland. You can take it up a notch by adding decorative lanterns or lights from the venue to give it a soft glow. You can also add mirror or sequin works for that extra effect.</p><hr><h4>Floral Backdrops décor</h4><p>Fresh flowers are one of the most used items for Indian wedding decorations. They are frequently used for stage backdrops and in other parts of the wedding decor. The bride's family brings fresh flowers, usually marigold, roses or orchids, which are used by the pandit during the puja. The flowers are also sprinkled on the couples as they sit around the fire while taking their seven marital vows.</p></br><img src=\"https://www.shaadiplans.com/wp-content/uploads/2020/11/ba7e0e993da6bdc90056ecaa959f4b42.jpg\" class=\"col-sm-12\"></br><p>You could have flower bouquets that are well spaced or an entire flower wall depending on your taste and budget. Local flowers like marigold, roses, jasmine, gerbera, and carnation can be used, and if there are no budget constraints, seasonal flowers can be imported. This style of backdrop brings a special kind of class to your wedding.</p><hr><h4>Paper or simple Backdrop</h4></br><img src=\"https://i.ytimg.com/vi/55--HQbCZLs/maxresdefault.jpg\" class=\"col-sm-12\"></br><p>This is a great choice if you are on a budget for the wedding decorations. Artificial fabric flowers, paper-made flowers and cut-outs are used to make stunning designs for your backdrop. From a combination of multiple colors or a particular color scheme, you can express lots of creativity with this type of backdrop.</p><hr><h4>Themed Indian Wedding Décor</h4><p>Theme based decorations are a modern concept for Indian weddings. This is currently one of the most popular trends in Indian weddings. In this picture, the couple decided to go with a nature themed wedding in the open with the stage built out of wood and the greenery, decorated with flowers.</p></br><img src=\"https://i.pinimg.com/originals/2b/96/3b/2b963b11a7de12f84afd853c87c1988e.jpg\" class=\"col-sm-12\"></br></br><img src=\"https://images.shaadisaga.com/shaadisaga_production/photos/pictures/001/324/097/original/darkdecor3.jpg?1577104282\" class=\"col-sm-12\"></br><p>This type of wedding decoration creates a striking contrast from the conventional way of decorating weddings. Wedding themes can be anything from an elaborate recreated palace, destination location, or even a movie set. You can go as big or as small as you want with your wedding theme. Hiring a professional wedding decorator will help you make the right theme choice, and ensure all the concepts in the wedding come together.</p><hr><h4>Stage decor at the beach</h4></br><img src=\"https://images.shaadisaga.com/shaadisaga_production/photos/pictures/001/704/252/new_large/89392251_2497068247064069_7095273921600937248_n.jpg?1587373853\" class=\"col-sm-12\"></br><p>When you want to make a statement and really want to make your wedding extra special then you can have stage setup next to the beach as it's not open, looks gorgeous but it could quickly become talk of the town!</p><hr><h4>Wedding Jhula or Swing</h4></br><img src=\"https://images.shaadisaga.com/shaadisaga_production/photos/pictures/000/395/589/new_medium/elite_wedding_planner.jpg?1524573152\" class=\"col-sm-12\"></br><p>The wedding jhula or the swing is where the couple sits during the sangeet ceremony, a significant place in the wedding, and why the decoration must be perfect. The jhula is decorated with beautiful flowers, including marigolds, roses, orchids, etc., that the couple would like and most likely has picked out themselves. and the couple can also do a pre-wedding shoot here.</p><hr><h4>The Mandap or the Wedding Arch </h4></br><img src=\" https://www.zowed.com/blog/wp-content/uploads/2020/05/Pastel-01-F5-Weddings.jpg\" class=\"col-sm-12\"></br><p>This is where the bride and groom exchange vows. Hence, it is considered to be the most important aspect of Indian wedding decorations. The Mandap is decorated with natural flowers, including rose, tulip, orchid, marigold, etc. The mandap has pots around it. The pots are placed on four sides of the arch. The choice of colors for the mandap is decided by both the groom and the bride. This decoration can be in line with the theme of the wedding or have its special theme. As critical as it is to the whole scope of the wedding, there is no limit to the amount of creativity which can be made use of while decorating the Mandap or the wedding arch.The wedding arch or the mandap can be decorated simply or can be more elaborate in its design and decoration. The mandap is decorated  based on the location of your wedding venue. Outdoor mandap decorations are used for outdoor venues and the traditional mandap decoration for indoor venues.</p></br><img src=\"https://cdn0.weddingwire.in/img_g/articulos-india/2019/non-troncales/wedding-mandap-decoration-with-flowers/r10_2x_the-lightsmiths-wedding-mandap-decoration-with-flowers-lead.jpg\" class=\"col-sm-12\"></br><p><u>Tip</u>: - When you want a simple and close family member Indian Wedding, then go for something beautiful- flower mandap setup. It's not only gorgeous but would look amazing in the pictures!</p><hr><h4>Mandap in the Woods</h4></br><img src=\"https://i.pinimg.com/736x/dc/23/e1/dc23e1abb7d7cc12308b998f704d438c.jpg\" class=\"col-sm-12\"></br><p>This is one unique yet totally amazing Indian wedding mapdap setup in the woods. As you see how beautifully the wedding map dap is setup which is not only looking stunning but would easily become talk of the town!</p><hr><h4>Mandap decoration - The Ranch Style</h4></br><img src=\" https://getethnic.com/wp-content/uploads/2020/09/186947-ShailaAlok-58-orig.jpeg\" class=\"col-sm-12\"></br><p>This one is totally hot and happening at the same time. You can choose something like this when you have a huge open area. This setup is not too expensive but looks totally stunning in the pictures. The combination of fabric and flowers is magical which it why it has gained a lot of popularity in recent times.</p><hr><h4>The Chairs of Honor</h4></br><img src=\"https://weddingmandapmanufacturers.com/wp-content/uploads/2018/02/GOLDEN-WEDDING-SOFA.jpg\" class=\"col-sm-12\"></br><p>The two chairs for the bride and groom are decorated with natural flowers, which give it an appealing look. It is often made from sankheda wood. The wedding chair is a beautiful piece of furniture and it is designed exquisitely. After the Jaimala ceremony, the bride and groom sit on these chairs on the stage while friends, family and relatives from both the sides come up to meet the couple, give them gifts, wish them for their happy married life ahead, and afforce, take pictures with the bride and groom.</p><u><h4>Other Decorations in an Indian wedding</h4></u><p>There are certain elements that make an Indian wedding what it is. These elements are vital when choosing Indian wedding decorations and cannot be excluded. Here are some of the essential parts of an Indian wedding:</p><h4>Statue of Lord Ganesha</h4></br><img src=\"https://i.pinimg.com/originals/6c/f0/36/6cf036e7daca8b2079dda54c918c370c.jpg\" class=\"col-sm-12\"></br><p>The statue of Lord Ganesha is present in all Indian wedding ceremonies and is an important part of Indian wedding decorations.. In India it is believed that before the start of anything new the blessings of Lord Ganesha are said to bring success and prosperity, so the wedding ceremony rituals are always started by taking the blessings of Lord Ganesha so as to wish prosperity and happiness to the newly wedded couple’s lives and ward off any evils. It is decorated beautifully with colorful flowers and beautiful lighted lamps around it.Diyas and other Puja Samagri is also placed around the statue of the deity as instructed by the Pandit.</p><hr><h4>Wedding Jaimala</h4></br><img src=\"https://i2.wp.com/www.weddingsutra.com/images/wedding-images/entertaining/varmala/varmala-pic7.jpg?ssl=1\" class=\"col-sm-12\"></br><p>It has been practiced since the inception of Indian weddings and is one of the significant features of the wedding. The wedding jaimala is a string of flowers usually made from roses, which gives it a beautiful look. The jaimala or garlands are usually exchanged by the bride and groom at the start of the the wedding ceremony.</p><hr><h4>Bridal Doli Decoration</h4></br><img src=\"https://i.pinimg.com/originals/5e/a1/f0/5ea1f0e847e992fbed62e3fe240d3479.jpg\" class=\"col-sm-12\"></br><p>Although the tradition is starting to phase out, it is still being done at several weddings. The bride is ushered into the Mandap inside a Doli. The Doli is decorated with beautiful natural flowers and bright colors. It is adorned with colorful palanquin lines.</p><hr><h4>Puja Tray or Thali</h4><p>The wedding tray has a lot of items, which are called puja saamagri — kumkum powder and flowers. The tray is decorated beautifully to make it presentable. The kumkum powder is believed to be the holiest item for the wedding puja. It is said that Kumkum powder is one of the signs of a holy union and adorned by women in various ceremonies. Other items include unbroken rice grains, kumkum powder, incense sticks, camphor, coconut, betel leaves, gold and silver coins with images of holy Hindu symbols (Om, Swastika or Shree symbols) and some prasad in the form of fruits or sweets.</p></br><img src=\" https://thumbs.dreamstime.com/b/indian-traditional-wedding-ceremony-decorative-puja-thali-indian-traditional-wedding-ceremony-decorative-puja-thali-218400989.jpg\" class=\"col-sm-12\"></br><p>These are of great importance in the marriage as the marriage cannot proceed without them. The parents of the bride and the groom exchange their wishes by applying Kumkum powder on each other’s foreheads. Turmeric and Kumkum are also compulsory for the puja tray, which is used to perform the marriage chants and vows. They are kept in precious boxes, which may or may not be designed. Pooja Thali can also be used in other wedding functions as well like Haldi Ceremony or Roka Ceremony.</p><hr><h4>Head Table</h4></br><img src=\"https://i.ytimg.com/vi/XAgXA8mfnyA/maxresdefault.jpg\" class=\"col-sm-12\"></br><p>The head table is meant for the bride and groom and is decorated with beautiful flowers and candles. The newly married couples sit on the head table to have their lunch and dinner during the ceremony. The table is also a very significant part of the ceremony because it symbolizes unity between the couples.</p><hr><h4>Photo-booth decorations</h4><p>The concept of having a photo-booth in Indian weddings is becoming increasingly popular. The photo-booth is a small decorated part that is used to take pictures by the couples with their relatives, friends, and other guests in the ceremony.</p></br><img src=\"https://images.shaadisaga.com/shaadisaga_production/photos/pictures/000/570/572/new_medium/nilma.jpg?1539601585\" class=\"col-sm-12\"></br><p>The photo-booth can be decorated by anyone with creative art skills. It is often decorated with both artificial and natural flowers, which give it an elegant look. The theme of the photo-booth can be built around the ideas suggested by the bride and the groom. It is simply an attractive background that adds colors to pictures. You can take beautiful selfies in the photo-booth to capture memories.</p><hr><h4>The Hawan Kund</h4></br><img src=\" https://getethnic.com/wp-content/uploads/2020/08/17fdfdfdrere16ytyfgfgfgfg15fgfgfgf14hghghghindian-pre-wedding-photography-chapel-hill-nc-29.jpg\" class=\"col-sm-12\"></br><p>The Hawan Kund or the Alter is the most significant aspect of any puja in the Hindu culture. It is a square-like container that has woods in it that allow it to burn for some time. It is situated at a place where it burns until the end of the ceremony.</p><p>Indian wedding ceremonies are incomplete without certain rituals. These rituals are necessary for the wedding to take place, and they sometimes influence the choice of Indian wedding decorations.</p><h4>Final Word – Indian Wedding Decoration</h4><p>An Indian wedding is truly a beautiful sight to behold. The decorations are mostly the highlight. The colors give the ceremony an exquisite beauty that will leave you truly amazed. Other things add colors to the ceremony, including the different sarees worn, bridal jewelry, accessories, and so on.</p><p>There are several things to look out for as far as an Indian wedding ceremony is concerned. Consulting with a professional decorator will make the process smoother, as you get to leave all the worrying to someone else.</p><p>You probably want your wedding to be the talk of the town. There are certain things you must not forget while preparing for an Indian party and to help you are family members who have planned past events. You could also hire a wedding planner to give you some professional insights for the best Indian wedding decorations. But if you’re the lucky one reading this blog, then, you are at the right place as we at EVENTLOPE are professionals with a lot of experience and creative ideas to make you remember that you attended a wedding ceremony worth remembering. Just book us and make the next wedding in your family or for your friends or even your very own dream wedding come true with us. You will NOT BE DISAPOINTED!</p>"
    },
    {
      "id": 15,
      "title": "What goes wrong with virtual events and how can we fix them",
      "background": "https://images.pexels.com/photos/4240504/pexels-photo-4240504.jpeg?auto=compress&cs=tinysrgb&dpr=3&h=750&w=1260",
      "highlight": "<p>It sucks when there is a hiccup while attending such events like someone unmuting themselves at inappropriate times, inappropriate background for the people speaking at the event or struggling to get into the event because of technical inconsistencies. Whatever it might be but it really can break the immersion for us and the entire event can turn into a sour tart for us and disappointment goes a long way for both the organizers and the attendees.</p>",
      "text": "<p>We all at some point of our lives have attended a virtual event for some or the other reason; may it be a Doctor’s panel discussion during the pandemic lockdown, a virtual convention or a virtual launch event. But it sucks when there is a hiccup while attending such events like someone unmuting themselves at inappropriate times, inappropriate background for the people speaking at the event or struggling to get into the event because of technical inconsistencies. Whatever it might be but it really can break the immersion for us and the entire event can turn into a sour tart for us and disappointment goes a long way for both the organizers and the attendees.</p><p>Here are some of the most common problems which if not managed properly can result in a flopped event:-</p><h4>Technical Issues</h4><p>A virtual event is completely dependent on technology. From selling tickets online through event ticketing platforms to airing the event through webcasting software, from interacting with virtual attendees on the day of the event to collecting feedback once it is over, everything happens through one software or the other. Then there is all the technical equipment that goes into the production of a virtual event: cameras, microphones, lighting equipment, tripods, and internet routers, to name a few.<p><p>An event app with bad user experience, a malfunctioning camera, or weak internet strength can all ruin the virtual event experience. Amateurish production will also show, and attendees—who’ve seen professionally produced YouTube videos and TV shows—will feel the difference and find your virtual event lacking. This might even lead to them giving up on your event midway. So be sure to invest in good technology and take it for a few test runs before the actual event. A lot of virtual events have failed due to technological glitches.</p><h4>Inviting inexperienced speakers</h4><p>Speakers are as new to virtual events as event organizers, and they know even less about it. However, most of them do have at least some experience with webinars. This could be seen as a plus and a minus when it comes to talking at a virtual event. Let’s start with the pros: they’re used to webinar tools and online interaction features like polls and chat, so they’ll adapt to your webcasting service faster. They also have more experience talking in front of a webcam.</p><p>The negative is they’re so used to the webinar format (with its presentations and long speeches) that they are more used to instructing their audience than interacting and engaging with them. And unlike with webinars, where people come to learn something new, with virtual events attendees come to be surprised and thoroughly engaged. So the webinar model will not work. This is something both the event planner and speaker have to keep in mind when planning a session’s content. Do a \"dress rehearsal\" of the session so the speaker is not left unaware or confused during the actual session, get speakers to upload all their content beforehand so there’s no rush on the event day, give the speakers a rundown of all the engagement tools available in your webcasting service so they can prepare their content accordingly, send them an onboarding manual for speakers with information like the different session formats, help documentation for using the webcasting service, commonly asked questions, and the event code of conduct. This way they know what to do, create a private chat group for speakers so they can get to know everyone and help each other. Speakers are the building blocks of a successful event, so make sure that you choose the right speakers and give them the tools they need to put out an interesting show.</p><h4>Boring program</h4><p>Content will always reign supreme. But even more so with virtual events. In-person events can use of a lot of things—lighting, decor, music, and even smell—to attract and stimulate attendees. All of these elements contribute to its mood and atmosphere, along with the content. However, most of these elements can’t be replicated successfully in virtual events, and neither can the high-energy environment of in-person events.</p><p>For virtual events, content is possibly the only element available at an organizer’s disposal when it comes to catching an attendee’s interest (and retaining it). Pay attention to your content and make it more than just PowerPoint presentations and keynote speeches. Make use of interactive session formats like breakout sessions or Flipped learning so they are interactive.</p><p>Another point to note is the length of the sessions. You can’t have long sessions with too much content even if the content is interesting. While this works for live events, people just don’t have to patience to stare at their screens for hours at a time, especially if they’re not actively involved in it. You can also incorporate a few wellness breaks into the day to avoid virtual event fatigue. The quality of your content is important, but how you present it is just as important.</p><h4>Too many distractions</h4><p>You probably already know this: the human attention span is decreasing a little every year. Today, it’s eight seconds—less than the attention span of a gold fish. Not only is our biology working against us, the event also has to compete with an attendee's family life, phone calls, emails, and social media— all of which will require their attention. So if you’ve planned a 10-hour event, you’re event is not going to make it. This is also the case with long sessions and boring content. If attendees are not glued to what’s happening on screen, they might just start scrolling through their social media feeds or surfing the internet.</p><p>It’s not just their lifestyle either—you could also create distractions from your side. Say you’ve created a cool background for your virtual stage using green screen technology. A background that has too many elements and too much contrast can also be distracting. It’s better to keep backgrounds minimalistic. Your environment should also be conducive to listening—less background noise, optimal lighting, clear camera production, and good sound. All of these contribute to holding attendee attention. The less distracting your event is, the more they’ll pay attention to it.</p><h4>Virtual Events Need Tech-Support</h4><p>Not everyone is comfortable with new software, and some people won’t understand some tech-terminology. So plan for this, and you’ll be glad you did. Here are some tips to ensure attendees feel included, even if they’re not very tech-savvy: </p><ol><li><p>Google common troubleshooting questions for the software you’re using. You’ll be able to share help docs with those who need it. Maybe you’ll even add links to these documents in an email or your event website.</p></li><li><p>Have alternative ways to access the event. The most common solution is phone call-ins, which Zoom and many others provide. There will always be people who can’t get technology to work, and sound is a common point of failure. So having a phone option allows them to listen in. </p></li><li><p>Have a partner. The second pair of eyes and ears can be a huge help. They’ll notice if your video is glitch, or your sound is too soft. They’ll also see if the camera is pointing up your nose (true story!). While you’re focused on running the event, they can answer attendee questions and act as support staff. </p></li><li><p>Take the time to learn the software. Whether it’s Zoom, HopIn, or anything else, invest in exploring every button. You’ll want to know how to mute attendees and turn other people’s videos off. Also, know where to find the meeting URL and how to invite others. </p></li><li><p>Ensure that you understand how to give screen sharing access to presenters, how to change hosts, and how to answer chat questions. Plus, if you know the software well, you might be inspired to use some of their features that you otherwise would have missed.</p></li></ol><p>Some other key points to keep in mind while organizing a virtual events are actually pretty simple yet very impactful; like inviting experienced speakers who can easily adapt to interacting with people instead of speaking out a lengthy PowerPoint presentation, designing the event backgrounds in a minimalistic way so as to avoid distractions and design the content in such a way that it does not feel like the event is an encyclopaedia of facts and numbers & it should be presented in a way that engages the audience instead of the whole event sounding like a lecture. Rehearse the event at least once before the main event and check weather everybody is comfortable and well versed with the event casting platform and check the audio, video and their synchronicity with the various parts of the e vent. Also, try to establish networking opportunities through virtual breakout rooms for the attendees and take their feedback through the app or any other suitable and familiar means.</p><p>In short, keep it short, sweet and entertaining for the attendees to keep the attendees reeled in and you have a successful event on your hands whose feedback will definitely bring positive results to the organizers.</p>"
    },
    {
      "id": 14,
      "title": "How To Choose The Perfect Wedding Venue",
      "background": "https://media.weddingz.in/images/5d398fe020d2569e5f0bc828786c1509/wedding-lawns-in-lucknow-to-celebrate-your-charismatic-wedding-1.jpg",
      "highlight": "<p>There are a lot of elements in a wedding that one can finalise closer to their D-Day, like flowers arrangements, a wedding cake or certain rituals; but a wedding venue is of priority to every couple… Afterall, it is the venue that decides where you will be hosting your family and friends to celebrate a milestone. Choosing your wedding venue should be your first consideration, before all else. However, picking the ‘right’ venue can be a process that takes days on end, is overwhelming and hard.</p>",
      "text": "<p>There are a lot of elements in a wedding that one can finalise closer to their D-Day, like flowers arrangements, a wedding cake or certain rituals; but a wedding venue is of priority to every couple… Afterall, it is the venue that decides where you will be hosting your family and friends to celebrate a milestone. Choosing your wedding venue should be your first consideration, before all else. As soon as the wedding date or month is finalised, Indian couples then seek to book their venue at least five to six months ahead. However, having to pick the ‘right’ venue can be a process that takes days on end, is overwhelming and hard. Here is a simple step by step guide to picking that ‘perfect’ wedding venue for your most special day.</p><h4>Knowing Your Vision</h4><p>Planning and envisioning your wedding day is the first step to making the right choice. To begin, ask yourself:<p>- What kind of venue would you like to be wed at and does it fit in your budget?</p><p>- Is there a specific wedding theme that you have in mind?</p><p>- Would you prefer an outdoor or indoor setting depending on when you want to get married?</p><p>- How many people would be at the wedding?</p><p>- Is the venue accessible for your guests and vendors?</p><p>- Is the venue you are choosing able to provide quick action in case of last-minute troubles?</p><p>- Does the venue provide the required amenities for the number of guests being invited?</p><p>For example, if you're planning a modern wedding, look at art galleries, well-designed restaurant spaces, or warehouses. On the flip side, a wedding incorporating more natural elements works well with outdoor venues such as parks, backyards, and ranches. Choosing a venue that fits in with (and enhances) your theme will enable your wedding to feel more connected to the space.</p><h4>Set Your Budget (and Ensure to Stay Within)</h4><p>Having a budget in mind while planning for your wedding is crucial. This also applies to selecting the wedding venue. It’s not just about renting a space, since other key aspects such as in-house catering (like in a hotel or restaurant) also have a price weather per unit or a lumpsum, décor and floral designs also drive costs up. Know how much your total budget is, as well as approximately what your design will cost to execute. If adding that on top of the cost of using the space blows your budget out of the water, you'll either need to scale back your design or look at more affordable spaces. Break down your overall budget by category, prioritizing more funds for vendors that are a higher priority. If you select your venue first, and then realize it's more than you should have allocated, it's an uphill battle to stay within your budget when you still have a dozen other people to hire.</p><h4>Check With Your Wedding Planner</h4><p>To plan an event as complex as a wedding, it is always good to have a professional’s opinion. Wedding planners provide you with advice that will help accomplish your vision, iron out details and elevate the wedding to create a unique experience for guests and to-be-weds. Your planner will ultimately know if the venue is worth your vision and their execution. Wedding Planners are much more familiar with the capabilities of a space, the layout, and the time and items you'll need to really transform it. If there's a creative way to make it unique or a quirk about the space that could make your vision hard to accomplish, your planner will know.</p><h4>Understanding Your Guests</h4><p>Knowing how many guests you would want at the wedding will save you from potential headaches down the road. Before moving forward with preparations, it is always a good measure to create an invite list using various online tools to keep a running tally of how many guests from both sides will be present at the venue and keeping track of how many of the guests are in proximity and how many guests will have to travel for the wedding. This will further help refine your venue selection. If you choose a venue that is too small for your guest list and more guests RSVP 'yes' than you can fit in the space, you might be in a tough situation. Couples often underestimate how many people they will invite (or how many their parents will want to add), so have that conversation early to know what you're really working with. This will also help you break down your budget, as some costs are very dependent on the number of people you're inviting,</p><h4>Do your Research about the venue and read the Terms & Conditions Carefully</h4><p>Before zeroing down on your venue, we recommend going through each venue’s FAQs and asking as many questions as possible to help you make a confident choice. Ahead of finalising the venue, paying a deposit and signing a contract, it advisable to check images and videos of the setting, read consumer reviews and terms and conditions to gain a sense of personal guarantees, clauses for cancellations, deposits, etc. You can get the best results by visiting the venue in person, confirming and clarifying everything with the venue management in case if you’re doing everything solo without consulting an event planer AND who knows you might get them to agree for a personal discount on a package deal based on your negotiation skills.</p><p>If everything is planned right, then you and your partner can expect to give a memorable experience to all the people attending your wedding and in the process create the most unforgettable memories which both of you can cherish for the rest of your lives. But don’t worry if all of this feels intimating to you; because EVENTLOPE has all these bases covered. Just contact us and we will take care of the rest just the way you like. You can also avail some awesome discounts and offers when booking your Special Day with us. WATCH THE MAGIC UNFOLD.</p>"
    },
    {
      "id": 13,
      "title": "Top 10 Skills For Event Planners",
      "background": "../images/blogs/blog-13.jpg",
      "highlight": "<p>Event management is a competitive industry, and there are many different event management skills you’ll need in order to thrive in your career.</p>",
      "text": "<p>Event management is a competitive industry, and there are many different event management skills you’ll need in order to thrive in your career. When your event could involve juggling live performances, technology, food service, and large groups of people — whether in-person or virtual — you’ll definitely need to be ready to wear many hats. A good event manager has some skills that help them to shine through in the event they organize and in the competitive event industry as well. Here are the top 10 skills that can make you that guy that everyone can plan their next event.</p><h4>1. People skills</h4><p>The number one quality shared by successful event managers is people skill. You need to be comfortable connecting with high-level executives, government officials, vendors, co-workers, sponsor reps, customers, supervisors, suppliers, staff, and event attendees. To successfully work with this wide range of people, you’ll need to be able to nimbly resolve conflicts, be a confident but pleasant negotiator, and maintain your sense of humour. Remember — try to have fun with the work you do, and the people you work with, and they’ll want to work with you again. You can’t do it all by yourself, so building relationships is key.</p><h4>2. Organization</h4><p>Event planners have great organizational skills. Some people can work in chaos, but as a planner it’s important to rely on process and method if you are part of a team. This multi-tasking prowess is one of the key skills for event management, required for both smooth planning and flawless execution of an event. The best planners have fool proof systems, step-by-step checklists, and handy tech tools. Working in events requires the ability to focus on the big picture while keeping track of all the little details. To avoid burnouts, get comfortable delegating some of your more time-consuming tasks. And if things don’t go according to plan, don’t be afraid to switch to Plan B.</p><h4>3. Communication Skills</h4><p>Another must-have quality of an event planner is the ability to interact and build a rapport in a short time. Event planners possess great communication skills and aren’t afraid to talk to executives, event attendees, donors, brand sponsors, and, of course, vendors. Strong interpersonal skills are a must to ensure everybody involved in the event understands their role and things run without a glitch. You also need to possess equally strong writing skills to convey information accurately with confidence, respect, and clarity. Event planners are great listeners, which helps them understand the needs and wants of their clients.</p><h4>4. Passion</h4><p>With all the stress of being an event planner, it’s important to really love what you do. Genuine passion helps you overcome bumps in the road and stay cool when all seems lost. It also leads to bursts of creativity and productivity, as opposed to just trying to get through the day. Things like time management can be learned, but you can’t teach passion. Being an event manager can, at times, be a thankless job, so it needs to be about more than just a pay cheque for you.</p><h4>5. Leadership Capability</h4><p>Your team will look to you for answers to almost everything. In moments of stress, the last thing they need is a shaky leader who makes poor decisions because they’re cracking under pressure. Event managers need to be able to make several decisions at once and make them quickly. And, perhaps more importantly, they need to be able to recognize when it’s too late to change those decisions — and have the resolve to stand by them, stay level-headed and continue to treat everyone with respect, no matter what, try to remain cool, calm, and collected when dealing with other people, even if you’re a bundle of nerves inside.</p><h4>6. Problem-solving skills</h4><p>Whether it’s tracking down some emergency duct tape or reworking a keynote presentation at the last minute, you have to be resourceful with what you have. No matter how well you plan, something will go wrong. And it will be a lot easier to address if you enjoy finding creative solutions to the challenges that arise.</p><h4>7. Knowledge</h4><p>It will be a lot easier for people to trust you if you have a significant amount of experience because there’s no better way to learn than by doing. And your job will be easier for you once you’ve seen the range of challenges an event can throw at you. Plus, the experienced manager has a network of trusted professionals to call on when things get tough. If you don’t have a ton of knowledge yet, getting a certificate or taking a course can help get you on your way.</p><h4>8. Networking</h4><p>Event planners are savvy networkers. Networking is an essential event planning skill since the events industry is based on relationships and is heavily people-driven. It demands a widespread network of vendors, including photographers, lighting and A/V décor, DJs, bands, videographers, etc. This is a network of people you’ll bank upon to make your events memorable.</p><h4>9. Negotiation and Budgeting</h4><p>If you consider yourself good at bargaining, then you possess an important event planning skill. It is crucial for event planners to be able to negotiate a contract with a sponsor or get the best possible deal while booking a venue. Negotiating is an art that requires a mix of preparation, tact, and confidence. Budgeting requires forecasting and tracking spend while juggling invoices, proposals, and expenses.</p><h4>10.Tech Savvy</h4><p>Not so long ago, technology in the events industry was considered a nice bonus, but not needed. Not anymore. Today, technology solutions act as an extended team of event planners. With the pandemic changing this industry to a large extent it’s important to be willing to learn how to use tech solutions and stay up to date on the current trends in the industry and become well-versed in planning and organising engaging virtual events.</p><p>If you have most of these event planning skills, chances are you’ll do a great job at being an event planner. If not, you can still become a successful event professional since most of these can be developed through determination and willingness to learn. It is all about continuous learning and improving with each event. It’s a common saying,<strong><em>\"TIME IS THE BEST TEACHER\"</em></strong> and it is true for the event industry as well; so keep giving your best and you’ll surely succeed despite all odds.</p>"
    },
    {
      "id": 12,
      "title": "Why Are Event Planners Needed?",
      "background": "https://images.unsplash.com/photo-1546074177-ffdda98d214f?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=967&q=80",
      "highlight": "<p>Hiring an event planner may seem, to many people, to be an unnecessary and added expense. However, precisely the opposite is true.</p>",
      "text": "<p>Hiring an event planner may seem, to many people, to be an unnecessary and added expense. However, precisely the opposite is true. An event planner can save you large amounts of money, in proportion to the size of your event. You might think that by planning and managing your own event; be it a birthday party, a marriage celebration or a professional event you would save yourself money and retain all the control of your event in YOUR OWN HANDS but it really pays to hire the PROs because they know how to plan, execute and manage your events in the best possible way and you get a lot access to a lot of perks and discounts that event planners and organizers get without loosing your mental calm.</p><p>Here are the top 5 reasons why you should hire an event planner to plan and manage your next event:</p><h4>1.You Benefit From Their Network Of Suppliers</h4><p>It's the job of event planners to retain a network of suppliers and vendors that they regularly deal with, from venues to flower suppliers to catering, among others. This special relationship enables the event planner to get discounts and deals that you may not get by going directly to the suppliers yourself. Because event planners handle multiple events, vendors and suppliers value the business these planners bring and oftentimes provide better pricing, with a special discount for the event planner. For example, a supplier may give you a quote of INR 10,000. However, an event planner who shares history with the same supplier, or even better ones who can give the same package, can perhaps get the same package for only INR 8,000. You benefit because you pay less for what you want, and the savings can go to the fee of the event planner.</p><h4>2. They Can Negotiate Better Deals Than You For You</h4><p>A good event planner will know what is important to the venue that you are booking, and should be able to negotiate a mutually beneficial contract for both you and the venue. For example, the event planner can negotiate complimentary services, reduced rates on rooms, upgrades, or perhaps lower rates or free use of meeting rooms. </p><h4>3. They Can Better Manage Time And Stress So You Don’t</h4><p>They say time is money, and an event planner saves you time so that you can do other things that may be more important to you. You also have peace of mind in knowing that someone is taking care of the details of your event in a professional manner. Others say that health is wealth. An event planner eliminates stress, especially in times of unexpected emergencies. For example, what if you planned an outdoor event and it suddenly rained? A good event planner will have trained staff and have a backup plan to handle such an emergency.</p><h4>4. You want to create something amazing!</h4><p>Everyone wants to host The-Best-Event-Ever. The one that is remembered for all the right reasons, the one that left an impression and was considered an overwhelming success by all those that attended. To achieve that type of event or wedding it’s not just about how it looks. It is about how it’s planned and executed and that takes skills. Do you have all those skills? Do you trust yourself to turn your vision into reality? Calling in the professionals, with years of experience, loads of great contacts and the necessary organisational skills, will ensure you and your guests won’t be disappointed.</p><h4>5. You need your event to meet key branding, marketing and business objectives</h4><p>Choosing to work with a professional event planner or engage an event management company can not only save you time and money, but can ensure you meet all your key objectives. They can ensure your event is on brand. They can implement a clever social media strategy for before, during and after the event. They can help market the event and attract the right attendees. They can ensure your event is not just a date in the diary, but a successful, wholistic experience that reaches beyond the event and engages with a wider audience.</p><p>If you are planning an event and want it to be a success, choosing to spend some of your budget on an event planner will ensure you save time, money and stress in the long run. It will also be the investment you make that turns your event concept into an amazing, rave-worthy experience that everyone will be wanting to attend and talking about for years to come. So, to cover all your event related needs, dreams and aspirations, Eventlope has got you covered with our professional team of event planners and event managers who have a sizable experience in planning, managing, marketing and executing all types of events. To book us for your next exciting event, visit our Contact us page.</p>"
    },
    {
      "id": 11,
      "title": "A to Z of event sponsorship",
      "background": "https://cdn.pixabay.com/photo/2015/10/02/15/00/diary-968592_960_720.jpg",
      "highlight": "<p> An event sponsor is a company that supports an event, usually by providing funds, in exchange for something valuable.</p>",
      "text": "<h4>What Are Event Sponsors?</h4><p>An event sponsor is a company that supports an event, usually by providing funds, in exchange for something valuable. Oftentimes this <em>\"something valuable\"</em> comes in the form of increased brand exposure, access to attendee data, speaking opportunities at the event, or discounted event tickets. Companies sponsor events that benefit them in some way and a partnership is forged when both the event planners and the organization see such value in an event that furthers their reach among a wider range of potential audience while improving the overall standard of the event. </p><h4>Why Is It Important To Have Event Sponsors?</h4><p>Running an event is an expensive endeavour. Rarely are ticket sales alone enough to break even—at least not while keeping ticket prices affordable. What’s an event planner to do? Secure event sponsorships. Securing event sponsorship helps in planning a financially viable event and keep ticket prices down, ensuring more attendees will be able to come. And with the recent shift to virtual, almost 80% of organizers are offering free registration to their attendees, which lowers the barrier of entry and thus, means greater reach for event planners. </p><p>A good sponsor also lends credibility to an event and creates trust in the people attending it. Just bring in a big sponsor and see your event skyrocket in popularity. Be honest—all things being equal, would you rather attend an event with no sponsors or one that’s sponsored by Amazon? Most of us would rather attend the event sponsored by Amazon, even if both events were being put on by the same company, were on the same topic, and had the same speakers. Why? Because Amazon is one of the biggest companies in the world and if they decide to sponsor an event, then it must be good.While partnering with a company like Amazon may be a stretch, securing known and respected brands in your organization’s field to sponsor your event will lend instant credibility and likely increase registration numbers.</p><p>Lastly, sponsors may be able to provide your event with other resources and perks beyond just money and credibility. For example, perhaps your event partners with a local restaurant. In exchange for promoting their business to all of your attendees, they’ll allow you to use their event space and will provide catered lunches.</p><p>Another perk that sponsoring companies can provide is increased exposure for your event. Let’s say a customer of a sponsoring company is browsing that particular sponsor’s social media feed and sees that they’ve partnered with you. The customer may decide to attend your event because they trust the sponsoring company.</p><h4>How To Identify The Right Sponsor For An Event?</h4><p>Now that we know how important is an event sponsor for organizing a commercially viable as well as an aesthetically appealing event, finding the right event sponsors is crucial for the execution of a successful event. For example, McDonalds sponsoring an event about healthy lifestyle and the likes is a NO-NO. Rather than spamming every business you find and presenting them with event sponsorship proposals, first identify the kinds of companies that would be a good fit. Then reach out and interact with only those brands. Contacting organizations that don’t align with your event brand, or don’t have a history of sponsoring events isn’t productive. Taking the time to find the right partners will also save you time and increase your success rate.</p><h4>How To Pitch Your Event To A Potential Investor?</h4><p>After considerable research has been done about the potential sponsors of the event in question and the target demographic of the audience attending the event, it is now time to meet these potential sponsors and pitch your plans for a sponsorship deal.</p><p>While pitching your event, keep the value the event will provide in centre. No organization will support your event out of the goodness in its heart. There needs to be an equal exchange of value and you need to communicate this value in your pitch. To do this, make your pitch about the company you’re contacting, not your event and focus on how it benefits them. Include information like how many attendees you expect to have, your audience demographics, brands that have sponsored your event in the past and any other piece of important information that you think might help your potential sponsor become interested in sponsoring your event. Proving value is difficult enough for live events, but it’s even more challenging virtually. Call out the value sponsors will see if they partner with your event and focus on the benefits of a virtual event.</p><p>Social proof in the form of testimonials from previous partners can go a long way towards convincing a brand to sponsor your event. Just like we all read product reviews before making online purchases, potential sponsors will want to know if previous partners had a good experience with your brand and found sponsorship to be a worthwhile investment.</p><p>The key to both pitching and partnering with sponsors boils down to communication. As you begin to work with sponsors, it’s important to have a common language. This allows you to align on key business goals and outcomes that make both parties successful. Using private conversations on digital platforms or virtual meetings can create seamless communication between both the event marketers and the sponsors. Both parties can communicate and agree upon opportunities that benefit them mutually in some way.</p><h4>How To Secure a Deal With A Sponsor?</h4><p>There are certain factors that determine whether you get that deal finalised by the sponsor of choice.</p><ol><li><p>Creating a tier list of all the perks a sponsor can avail from their involvement in the event and then selling it as different sponsoring packages each with different perks for the sponsor can really up your game when pitching your event to a potential sponsor. This will likely have the sponsor give you the funding and/or other resources you need to get the event going. For example-<ol type=\"a\"><li><p>The Bronze Package:- Your company logo on all event marketing materials, a guaranteed digital sponsor page, a virtual sponsorship gift, sponsor placement in lower thirds, 30-second promo video before keynote session.</p></li><li><p>The Silver Package:- Everything in the Bronze Package + branded transitions between videos and/or sessions. (Only 25 available.)</p></li><li><p>The Gold Package:- Everything in the Bronze and Silver Packages + a branded lounge area for the VIP clients and exclusive networking privileges with these VIP guests.</p><p>The more money an organization pays, the more benefits they receive. You can also create different packages for companies as opposed to individuals, give discounts when multiple tickets are purchased at once, and more.</p></li></ol><li><p>As stated earlier, the pitch of your event to your potential sponsor must communicate the value they will receive from sponsoring the event. And what better way to do so by creating exclusivity for the sponsor to showcase their brand. There are many different ways to add value to your sponsorship packages. A few sponsorship ideas include guaranteeing a speaking slot for the CEO of a sponsoring company, allowing partners to put their company names on breakout rooms, and including a sponsor’s logo on the merchandise given to each attendee as mementos. Everybody knows <em>\"Exclusivity Sells\"</em> and these exclusive opportunities can really make sponsors spring up and loosen their pockets to give you that big budget you were hoping for. This is because First, it’s a simple mathematics equation. There’s only so much time in the day and resources on hand. If you were to let more companies participate, the value of the package would go down. Second, exclusivity breeds desire. As humans, we always want what we can’t have. And we tend to feel better about ourselves when we have what others want but can’t get. Making your top sponsorship packages exclusive will increase the chances of people wanting to buy them.</p></li><li><p>Your event sponsorship packages will only sell if potential sponsors understand exactly what they will receive once they make a purchase. They’ll also need to know how to become eligible for each package. Clarity is absolutely your friend here. Spell out every package benefit, perk, and requirement in crystal clear language. Potential sponsors should never have to guess at what they’ll receive in exchange for a portion of their company’s budget. This is especially true when selling sponsorships for large sums of money.</p></li><li><p>Virtual and hybrid events rely more on technology than in-person events did previously. Over 50% of organizers believe event technology tools will play a key role in connecting sponsors and attendees both virtually and in-person. So it’s important to find a platform that allows you to create a great website to attract sponsors.</p></li></ol><h4>Providing ROI To the Sponsor</h4><p>The most important thing here is that the potential sponsor of an event might want to see the profitability that other sponsors received from sponsoring your events. You can show the data of the number of attendees in the event and their testimonials from the post event surveys, the networking and marketing opportunities other sponsors have received from sponsoring your events. When a potential gets a hold of such data that indicates that sponsoring your event can bring them manifold returns, they can easily give you the amount you were hoping for. Also, sponsors like to see their profits go up from their association to another brand so if you can get hold of such figures then don’t leave any stone unturned to get these figures.</p><p>So now that you know everything about Sponsorships, a quick heads up for you the reader, We are an Event Organizer Company, ready and capable to handle all your needs for any event; from wedding parties and receptions to corporate events and moving for social awareness causes to trade exhibitions; we have you covered from every angle. So don’t hesitate to reach out to us for any need you might have for organizing any type of event. And is you would like to be a future partner in our big plans, welcome aboard in advance.</p>"
    },
    {
      "id": 10,
      "title": "Motivate Urself",
      "background": "https://images.unsplash.com/photo-1528716321680-815a8cdb8cbe?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=710&q=80",
      "highlight": "<p>There's no denying that the past year has been hard for event creators.</p>",
      "text": "<p>There’s no denying that the past year has been hard for event creators. With venues closed, restrictions constantly changing, and new safety regulations to get your head around, it can be hard to stay motivated. While it’s normal for your energy and enthusiasm to ebb, losing your mojo needn’t mean losing everything you’ve worked for.</p><p>These tips on getting through tough times will help you cope with complications, boost your motivation, and reaffirm your commitment to the cause.</p><h4>1. Remember your mission:-</h4><p>Remember why you’re doing what you’re doing. What were your goals when you started? What have you achieved so far? Who would you be letting down if you gave up?</p><p>If you’re not sure, it can be helpful to sit down for a goal-setting session. Write down your ambitions, successes, and key motivating factors to remind yourself daily what you’re working towards. This way, you’ll be able to get through small tasks by focusing on how they help to advance your overall mission.</p><h4>2. Visualise a successful outcome:-</h4><p>Visualisation is a technique used by professional athletes, actors, and musicians. By picturing themselves succeeding before performing, they’re able to greatly increase their chances of actually experiencing success.</p><p>This technique can be applied to any aspect of life. Whatever it is that you want to achieve, simply imagine it happening. The more detailed the visualisation, the better – from the conversations you have and the words you speak, right down to the clothes you’re wearing and the weather.</p><p>When you think of a big goal, it can be all too easy to focus on the obstacles in your way, especially when having to deal with tough times. This is actually negative visualisation and only acts to stand between you and your dreams. If you want to be victorious, think victorious.</p><h4>3. Take a break and treat yourself:-</h4><p>You’ve heard the old saying: “A change is as good as a rest.” Well, it’s also true that a rest can be as good as a change. Sometimes we just need a bit of space to get our groove back.</p><p>If you can, take a holiday, even if it’s just a “staycation.” Enjoy some rest and recuperation on the sofa, try a new activity, or head out for long walks in nature. A week away from your desk can work wonders for boosting flagging motivation and reigniting your creativity.</p><p>If you can’t step back for a week, make your weekends work for you by seeking a little tranquillity and indulgence. Put your phone on “do not disturb” mode and focus on self-care, whether that’s having an at-home spa day or spending time on your hobbies.</p><h4>4. Break down big and scary challenges:-</h4><p>You can make big challenges less intimidating by breaking them down into component parts. By setting small, more easily achievable goals, you’ll achieve the satisfaction of regularly realising them.</p><p>This feeling of success is a wonderful motivator. And if you keep accomplishing small goals, before you know it, you’ll be halfway to fulfilling a big one.</p><h4>5. Celebrate each small victory:-</h4><p>When you’re working towards a big goal, it can be easy to lose sight of the little successes. But just because you’re focused on signing up 20 new attendees to your online workshop, it doesn’t mean you shouldn’t celebrate each one you secure.</p><p>Treating yourself every time you hit a milestone is one of the best strategies to motivate yourself. You don’t need to pop a bottle of champagne every time, but you should treat yourself to something small like a bar of chocolate.</p><h4>6. Share your challenges and ask for support:-</h4><p>If you feel out of your depth, don’t be afraid to turn to others for help. Perhaps you have an old boss or other business mentor who’s been through similar challenges and can share their experiences and knowledge.</p><p>Alternatively, try the power of collective problem-solving by discussing the challenges with your team. You don’t have to go it alone, even if you’re the boss. You can also ask your community for support. Even if you’re not running events at the moment, past attendees may be able to help out by offering feedback.</p><h4>7. Get inspired with your favourite movies, books, and songs:-</h4><p>We spoke earlier about the importance of taking a break once in a while and refocusing yourself. Getting lost in a great movie or book is a really effective way to do this. Choose one with an inspirational message – the feel-good ending will leave you on a high, feeling ready to slay your own dragons.</p><p>If you need a quick fix, simply stick on your favourite song and sing along. Belting out life-affirming lyrics can work wonders when times are tough.</p><h4>8. Promise yourself a big reward once you reach your final goal:-</h4><p>All big companies understand the power of incentives. Promising their executives a money-can’t-buy experience in recognition of great work is a tried and trusted motivational technique. It works for self-motivation, too.</p><p>What would encourage you to keep going? Devise and plan your perfect reward and display a reminder on your desk. Don’t forget to visualise yourself enjoying it and you’re bound to make it happen.</p><h4>9. Get physical with some exercise:-</h4><p>When you have no motivation, strap on your trainers. Heading out for a jog or participating in a fitness event can boost your endorphin levels – helping you out of your low mood.</p><p>Studies have shown that exercising regularly can help to reduce stress and boost self-esteem. Over time, it’ll also raise your endurance levels, so you’ll have more energy to think clearly and come up with exciting new ideas.</p><h4>10. Stick to a routine to beat procrastination:- </h4><p>Even if you don’t usually enjoy having a strict schedule, building a routine can help you to regain your enthusiasm and feel more in control. Setting yourself soft deadlines throughout the day also makes it more likely that you’ll get the job done.</p><p>Sit down and create a schedule that you think you can stick to. If you’re not an early riser, don’t force yourself to get up at 7 a.m. – set yourself up for success instead. Remember to add breaks, and give yourself things to look forward to in the evening so you have a reward for finishing on time.</p><p>If procrastination is a big issue for you, try scheduling the tasks you dislike the most in the first hour of the day. This strategy is known as “eating the frog,” after a famous quote by Mark Twain: “If it’s your job to eat a frog, it’s best to do it first thing in the morning. And if it’s your job to eat two frogs, it’s best to eat the biggest one first.” Getting things out of the way early will take weight off your shoulders, so you can enjoy your day without having the “frog” at the back of your mind.</p><p>Getting through tough times all year round</p><p>No matter what the day brings, don’t forget that each new morning offers a new opportunity to get it right. Pandemic or not, difficult times are just a fact of life. There will be moments in the future when you feel yourself struggling while organising events, so remember to use these motivation tips to get back on top. Try your best to work towards your goals each and every day, celebrate the small successes, and the big achievements will surely follow.</p><p>It’s time to get motivated – connect with others who are in the same boat.</p>"
    },
    {
      "id": 9,
      "title": "Ways to coping with stress",
      "background": "https://cdn.pixabay.com/photo/2018/03/30/13/10/woman-3275328_960_720.jpg",
      "highlight": "<p>Every year Event planners make the list of the most stressful jobs. In 2020, we were the third-highest ranked job that deals with stress, after surgeons and police officers – crazy! Stress is something Event Planners face almost every day.</p>",
      "text": "<p>Every year Event planners make the list of the most stressful jobs. In 2020, we were the third-highest ranked job that deals with stress, after surgeons and police officers – crazy! Stress is something Event Planners face almost every day. Whether it’s the stress of something going wrong like the weather or the stress of having too much to do, there are ways to handle stress, as you’ll find below:</p><p>If you are right in the middle of an event, step away for a moment and just take a few breaths and count to 10, which will help you get refocused and energized!</p><p>A second way to cope with stress is to exercise when you get a chance. Exercising releases endorphins which make you happier! It’s shown that people who get enough sleep and exercise have higher endorphins. Exercising will also help you when you have been on your feet for twelve hours and are exhausted – imagine being out of shape and doing that! Our job is stressful enough.</p><p>A third way to help combat stress is to have lavender oil nearby. Just by having the scent of lavender oil around can help (bonus – it’s great for your Emergency Kit to prevent fainting). If you have an inclination that someone may faint, spray some lavender oil on their bouquet.</p><p>Another way is to cut back on coffee. If you are constantly drinking coffee, studies show caffeine and coffee can make people anxious so opt for water instead!</p><p>Another way to combat stress is by keeping a journal. If you are stressed, just write down the reasons and how you can solve the problems. Having different options can help you make a better decision. If you have a gratitude journal, stop and take a moment to read one of the things you are grateful for. This will help you recognize why you are doing event planning – to make people happy!</p><p>My last tip for de-stressing in a moment’s time is chewing gum. This simple act sends brain waves that help you relax and calm down. Studies show the harder you chew the gum, the less stressed you will be.</p><p>While all these will help you combat stress learning how to say no to clients and not procrastinating are also great tips as well. Never be afraid to tell a client no! Sometimes their visions are literally impossible. Don’t be afraid to stand your ground.</p>"
    },
    {
      "id": 8,
      "title": "Events post Lockdown",
      "background": "https://images.unsplash.com/photo-1589692007437-94571bd0a274?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80",
      "highlight": "<p>Events bring people together. They educate, empower and inspire audiences. They also spark social movements. They can raise profits and build brand awareness. </p>",
      "text": "<p>Events bring people together. They educate, empower and inspire audiences. They also spark social movements. They can raise profits and build brand awareness. But the current pandemic of COVID 19 has caused a drastic change in the way we interact with others, live our lives and cope with challenges in changing scenarios of the present times. The same impact has been seen on the way we organize, conduct and attend everts. But is often said that out of a crisis comes opportunity for transformation.</p><p>The events industry has changed tremendously since the lockdown and will continue to change and adapt as per the current scenario. The way events are organized has changed to a large degree since the lockdown and with the looming threat of a Third Wave, it is imperative that new measures have to be adopted on how events can be organized so as to reach the same amount of audience without compromising with their safety and health while creating memorable experiences for all who attend and organize these events.</p><p>Since the Lockdown, a lot of companies have found refuge in the Digital world to create and spread brand awareness about themselves or their clients through social media promotions. Even all the artists, big or small have taken up the social media way to connect to their fan base on a wider scale as apposed to physical concerts and meetups. Virtual events can sometimes create a very impactful experience for those attending the event while reducing organizing costs and the attendees can enjoy from the comfort of their homes.</p><p>Although, virtual events have many advantages and can easily engage more people on a larger scale very efficiently, going back to the good old days of physical events will be tough in many aspects. Firstly, because of the ongoing pandemic, it can be problematic to attract the same number of people to attend a physical live event because of the fact that people have now adjusted themselves to the hobbit of attending all manner of events digitally and might also fear that they may contract illness from the virus if they attended any mass gathering.</p><p>Social distancing and hygiene will become a key factor when organizing any event. Access to live events will be tighter, requests may be made regarding the health and travel information of staff and participants. A system may be put into place to assess risk. With the outcome is yet to be known on immunity passports, proof of vaccine certificates or testing on-site, this is a sensitive area that will need to be regulated closely. The number of people attending such events will be limited, either by the Government mandate or arbitrarily by the organizers whilst a small and barebones crew of only the most necessary people will organize the events keeping view of the guidelines of physical distancing and crowd management. Say Goodbye to buffet systems at wedding receptions and large crowds of people doing casual networking in huge corporate exhibitions and say Hello to ready to eat lunch packs and networking on websites like LinkedIn. At the same time, hybrid events are seeing a rise in popularity and preference where a small number of people actually attend events physically while it is broadcasted for a wider audience online. Availability of hand sanitizing stations as well as segregating entry and exit points will also be a key factor while handling crowd management.</p><p>Although physically meeting clients and new prospective partners and suppliers will resume but the digital approach will still be preferred and people will prefer contactless check ins and payments with digital audio tours of exhibition grounds.</p><p>Travel and, therefore, international events might still be a long ways away because there is no universal vaccine nor is there any globally accepted international travel guideline even now or for POST COVID 19.</p><p>Now is the time to reorganise and restructure all that we know – to reassess our values and priorities and to remodel our approaches towards producing and attending events because the times are changing and so should we. It is said that out of a crisis comes opportunity for transformation.</p>"
    },
    {
      "id": 7,
      "title": "Wedding Themes - The secret Ingredient for timeless memories",
      "background": "https://images.unsplash.com/photo-1587271636175-90d58cdad458?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&ixlib=rb-1.2.1&auto=format&fit=crop&w=1050&q=80",
      "highlight": "<p>Weddings are about starting that new phase of your life in the best & heartiest way that you would cherish for a lifetime. </p>",
      "text": "<p>Weddings are about starting that new phase of your life in the best & heartiest way that you would cherish for a lifetime. </p><p>Selecting a wedding theme can take your traditional wedding from classic to tremendous with just a little extra planning. The couple may combine wedding themes or create something different or new simultaneously that can make the day unique to them. </p><p>There are different varieties of Wedding styles to choose from. Perhaps certain design or colour aspects attract us on a deeper level or maybe some iconic details have sentimental values. Once you spot your dream theme, you can move forward with the rest of Wedding plans. </p><p>But if you are still unable to decide which direction to go, we have mustered together the best wedding themes which are unique in their own way. </p><p> - Pastel Theme, Floral Theme, Fairy Tale Theme, Beach Wedding, Rustic Theme, Vintage Theme, Forest Theme, Boho Theme, Tropical, Desi Punjabi Wedding, Moroccan Theme, Poolside Wedding, Royal Wedding, Indian Traditional Wedding, Rajasthani Wedding, Celestial Theme or Modern Theme.</p><p>These trends are still on par with what couples want, but we’re also noticing an uptick in couples focussing on the emotional atmosphere of their Weddings.</p>"
    },
    {
      "id": 6,
      "title": "We work together",
      "background": "https://cdn.pixabay.com/photo/2017/06/27/11/48/team-spirit-2447163_960_720.jpg",
      "highlight": "<p>Everywhere you go people are always talking about the need for teamwork.</p>",
      "text": "<p>Everywhere you go people are always talking about the need for teamwork. Whether it is at the home, office, sports event being a team is always said to be the key to achieving success in whatever you’re doing. One famous quote says “If you want to go fast, go alone. If you want to go far, go together”. But, what is a team and why is teamwork so important?</p> <p>You might have the most talented group of people working together – but there’s one vital ingredient that you still need to succeed.</p> <p>Teamwork:-</p> <p>Teamwork is about more than simply being able to share a task with each other, bounce ideas or work in the same space. Effective teamwork not only helps your organisation go further and be more productive – it can also help each person on the team to exceed their own potential – and discover how far they can really go.</p> <p>It improves efficiency and productivity One of the greatest advantages of working together as a good team is that it can make life so much easier!</p> <p>By making sure that everyone is cooperating together and communicating effectively, you can really help to make sure the workload is shared between everyone. If any issues arise at any time – they can be identified and tackled promptly. This can make sure you avoid getting bogged down in any difficulties or problems – and work together to resolve them as soon as possible.</p> <p>A great way to work on this is by looking at how you approach a challenge as a team. Teambuilding exercises, such as completing a puzzle or treasure hunt with lots of clues are brilliant to develop these!</p><p>It brings a diverse range of views to the melting pot Another brilliant advantage of working with a group of people is the sheer diversity of ideas you get to experience.</p> <p>It’s great to have a wide variety of inspirations, ideas and approaches to problem-solving. Group brainstorming activities are a fantastic way of tackling a challenge together – as you can inspire each other to come up with potential solutions, discuss any obstacles that might arise, and reach an agreed decision as a group.</p> <p>Encourage every member of your team to share their views and ideas. While brainstorming activities are great, you can also try different ways to do this. Why not have a simple suggestion box where people can put in their thoughts? Or try silent brainstorming – a clever technique that makes sure everyone has a voice and gets heard.</p><p>It boosts trust and synergy in the workplace. Teamwork isn’t always just about the team as a whole, or the organisation you’re a part of.</p><p>Each person on the team matters – and they have their own individual talents, strengths and challenges.</p><p>Working as a team helps you build closer bonds with each other – as you learn how each person helps to contribute to your overall success, you can also begin to appreciate their value and aspirations as individuals too.</p><p>Help your team build closer ties by encouraging them to enjoy a regular night out or meal together – without any of the expectations of the workplace, it can be a great opportunity to get to know one another better, and foster greater trust.</p>"
    },
    {
      "id": 5,
      "title": "Why people judge event planners as tent wala, caterers, decor wala, flower wala, light wala, etc?",
      "background": "https://image.freepik.com/free-vector/business-people-planning-illustration-cartoon-employee-character-team-working-together-business-plan-scheduling-week-month-task-office-planner-calendar-concept-white_213110-445.jpg",
      "highlight": "<p>An event planner gives the whole concept of the event & ensures if everything is done in the right way. They have the responsibility of creating experiences and bringing visions to life.</p>",
      "text": "<p>An event planner gives the whole concept of the event & ensures if everything is done in the right way. They have the responsibility of creating experiences and bringing visions to life. </p> <p>They do everything included in making sure these events go smoothly, including choosing location, hiring caterers, entertainment and other vendors. They may also arrange lodging & transportation for attendees. </p> <p>They also have some more responsibilities – </p><p>- Meeting with clients & event stakeholders</p><p>- Outlining the scope of event including its date, time, location & budget</p> <p>- Venue recce</p> <p>- Negotiate & manage vendor contracts</p><p>But some people take event planners as vendors such as tent wala, caterers, decoration wala, flowers, etc. </p><p>Vendors are the ones who bring the designs to life. They are responsible for the overall atmosphere of the event. They have to work with event planners to develop & bring their vision to life. The event planner’s goal becomes the vendor’s goal. </p><p>We, at Eventlope are have a mission & vision to change the mentality of people towards event planners. And we are planning such events that will soon change the trend of events in Uttar Pradesh.</p>"
    },
    {
      "id": 4,
      "title": "Virtual Events are more tough than offline events",
      "background": "../images/blogs/blog-4.jpg",
      "highlight": "<p>Human beings are by nature social animals which contact/interact with each other as our brain wants it & we might all have realised this during the lockdown.</p>",
      "text": "<p>Human beings are by nature social animals which contact/interact with each other as our brain wants it & we might all have realised this during the lockdown.</p><p>We are all slightly turning to Homo Webiens. As most events are happening online, which in the beginning looked like a great opportunity for event managers but there’s an uncertainty of the audience in virtual events rather than offline events. </p> <p>Nowadays people are looking for those events in which they get some practical knowledge & it doesn’t matter if it is given by any celebrity or influencer or a professional. So now we have to focus on delivering some different information by which they can enhance their skills, knowledge, issues, etc.</p> <p>The Event Managers have to take care of every technical aspect; in offline events we can use technology and everything doesn’t rely on a stable internet connection, software system, etc. </p> <p>The difference in time zones of the audience makes a virtual event a lot harder. Also they are a lot less personal as the networking with people is just the same as doing it in person. </p> <p>If the platform used for an event is intuitive, it can cause trouble because the audience won’t want to spend too much time figuring out how to use the platform. </p> <p>The hardest part in organising virtual events is to attract people as the event should look like some great cumshaw to attract the audience. It’s almost very easy for people to walk away from these events because if any of the speaker babble for about 50-60 seconds – and you will see the participants leaving the event. The lack of interaction can kill even the most exciting subject, & thus potentially a whole event. To make it more engaging, we can have Q&A sessions, quick polls or let them share their own ideas. </p>"
    },
    {
      "id": 3,
      "title": "Importance of Hashtags",
      "background": "https://cdn.pixabay.com/photo/2018/05/17/15/10/social-3408791_960_720.jpg",
      "highlight": "<p>Hashtags expand your reach outside your network, open ways of communication, get more engagement & increase brand recognition and awareness. They are a great way for people to search for topics on social networks that have a common theme.</p>",
      "text": "<p>Hashtags expand your reach outside your network, open ways of communication, get more engagement & increase brand recognition and awareness. They are a great way for people to search for topics on social networks that have a common theme. </p> <p>When used properly, they are an integral part of digital marketing. They can help campaign to go viral & take its own life beyond your current user base. You can follow specific hashtags to stay updated on a current topic/trend, you can create your own hashtag to promote a new product or service. </p> <p>Hashtags are very simple and effective. It’s easily create & searchable, & has become an extraordinary marketing tool for businesses, organisations, celebrities & even the average individual.</p> <p>We, at Eventlope have our own hashtag which is #letschangetheuptrendtogether by working on which we intend to change the trend of events in Uttar Pradesh. As the people of UP don’t give too much importance to events, therefore, we intend to change their mentality towards it & bring the trend of Delhi- Mumbai here in Lucknow. </p> <p>What happens in the metro cities: Events are organised every weekend & people in these cities search for them & take part in these events. So we are working with our young and dynamic team to bring the same trend in Lucknow. We are planning to organize the biggest concert in Lucknow which will help in taking our motive forward. </p> <p>We have another hashtag which is #letschangethetrendtogether by which we want to change the trend to events in India & we are planning to bring the events which are organised abroad here in India.</p>"
    },
    {
      "id": 2,
      "title": "Missing the pre-pandemic events & losses during pandemic",
      "background": "https://cdn.pixabay.com/photo/2015/06/08/15/11/typewriter-801921_960_720.jpg",
      "highlight": "<p>As the months have passed, social distancing and stay-at-home orders have grown stale to the point of feeling unbearable at times. Boredom set in weeks ago and the process of adjusting to the new normal seems like an ongoing process that many of us are still trying to master. </p>",
      "text": "<p> As the months have passed, social distancing and stay-at-home orders have grown stale to the point of feeling unbearable at times. Boredom set in weeks ago and the process of adjusting to the new normal seems like an ongoing process that many of us are still trying to master. Returning to work for many people is bittersweet because although we can (finally) leave our homes and return to some semblance of a routine, the vision of masks, gloves, repeated sanitizing, and six-feet apart warnings reminds us that life definitely does not look or feel the same.</p> <p>Missing Out - The gradual opening of nonessential services and businesses is considered a step forward for many people while others worry about the potential of setbacks and health consequences. As society cautiously tests the waters, there are still many events and activities that are on hold indefinitely. Most celebratory activities, holiday events, and large social gatherings that we once enjoyed and never believed could threaten public health, are among those that experts anticipate will be forbidden for at least the remainder of this year or longer. Many of us have already missed out on celebrating milestones in the way we are accustomed to and as the months go by, these missed milestones will likely touch all of our lives eventually. </p> <p>Realizing New Gains - As we process the changes to our everyday life, it’s important to also consider the many experiences, values, and growth opportunities we have gained. Alongside the missed milestones are so many lessons and insights that we’ve developed during the pandemic. Ask anyone, even those who seem to struggle the most with adapting to these changes, and they will tell you something highly valuable that they’ve learned throughout these past few months—their own, personal eye-opening experiences. </p> <p>Below we will review a few common experiences and events that have been taken from our everyday lives only to be replaced with many other strengths, attributes, and sources of gratitude. </p> <p>Missed Milestone/ New Experiences</p> <p>→Gained Insights, Realizations, & Experiences - Graduations at all stages, grades, and levels</p> <p>→A lesser focus on the symbolism of the celebration and a greater realization of the hard work involved and finding satisfaction in being proud of oneself for the accomplishment. - Birthday celebrations in large groups</p> <p>→Appreciation of close loved ones and more alone time to reflect on a new year, new goals, and new hopes for the future. - Public leisure/entertainment activities (e.g., restaurants, malls, movie theatres, bars) </p> <p>→Realizing how much focus we place on material things, how much money we spend on unnecessary items/activities, and how none of these things are important next to the health of ourselves and our loved ones. – Boredom</p> <p>→Discovering new ways to stay busy and getting involved in new hobbies and activities. Realizing how much we depend on the constant stimulation of going out and 'doing something'. - Staying at home, too long and too often. </p> <p>→Appreciating home life, family life, and realizing how much time we spend at work while missing out on spending time with our spouse/partner and/or children.- News updates on fatalities. </p> <p>→Gratitude for our health, increased awareness of not only personal safety, but our social duty to do what we can to maintain the safety of others, especially vulnerable populations. </p> <p>Realizing Even More</p> <p>There are so many eye-opening experiences that have resulted from the pandemic, staying at home, and being unable to gather socially. For all the moments and experiences we have missed out on, we have found that we have gained so much more. The virus has, in a sense, brought healing to so many of us through our increased gratitude, appreciation, and renewed sense of meaning in our lives. Continue this exercise by listing the things in your life that have come to a pause or may be aspects of your life that you have lost entirely and may never get back and then think of the many parts of yourself and your life that have grown and developed from your loss. </p>"
    },
    {
      "id": 1,
      "title": "What will be the New normal?",
      "background": "https://cdn.pixabay.com/photo/2020/09/17/10/54/education-5578742_960_720.png",
      "highlight": "<p>While people believe that virtual events will become the new normal, will a video interface ever be able to deliver the experience of face-to-face interactions? Most importantly, will the purpose of networking and brand visibility be fulfilled by these virtual events?</p>",
      "text": "<p>While people believe that virtual events will become the new normal, will a video interface ever be able to deliver the experience of face-to-face interactions? Most importantly, will the purpose of networking and brand visibility be fulfilled by these virtual events? It’s a hard thing to conclude; currently, most organizers are tied by their situations to resort to virtual, but some events work best with in-person participation, like sports and concerts. </p><p>This, for sure, has given rise to a new buzzword in the events community, which is 'Hybrid'. As the term denotes, it’s a mix of virtual and in-person events—a webcast of an event that’s happening live somewhere. That sounds cool, right? It will surely increase the accessibility of the events and make it possible to attend virtually for those who cannot travel. But will all this lead to everyone appreciating the value of face-to-face events more than ever? Only time will tell. </p> <p>For now, we know there are tough times ahead, and we are confident that the incredibly resilient event industry will make it through them. We’ll work hard and smart and—most importantly—together to overcome the challenges ahead of us. If we do this, we’ll get back to the good times (or maybe better times) soon. </p><p>We hope that you are healthy and in good spirits. Stay safe. Stay strong. Stay positive!</p>"
    }
  ]
}
