{
  "data": [
    {
      "title": "Virtual Events are more tough than offline events",
      "background": "https://cdn.pixabay.com/photo/2017/05/19/06/22/desktop-2325627_960_720.jpg",
      "highlight": "<p>Human beings are by nature social animals which contact/interact with each other as our brain wants it & we might all have realised this during the lockdown.</p>",
      "text": "<p>Human beings are by nature social animals which contact/interact with each other as our brain wants it & we might all have realised this during the lockdown.</p><p>We are all slightly turning to Homo Webiens. As most events are happening online, which in the beginning looked like a great opportunity for event managers but there’s an uncertainty of the audience in virtual events rather than offline events. </p> <p>Nowadays people are looking for those events in which they get some practical knowledge & it doesn’t matter if it is given by any celebrity or influencer or a professional. So now we have to focus on delivering some different information by which they can enhance their skills, knowledge, issues, etc.</p> <p>The Event Managers have to take care of every technical aspect; in offline events we can use technology and everything doesn’t rely on a stable internet connection, software system, etc. </p> <p>The difference in time zones of the audience makes a virtual event a lot harder. Also they are a lot less personal as the networking with people is just the same as doing it in person. </p> <p>If the platform used for an event is intuitive, it can cause trouble because the audience won’t want to spend too much time figuring out how to use the platform. </p> <p>The hardest part in organising virtual events is to attract people as the event should look like some great cumshaw to attract the audience. It’s almost very easy for people to walk away from these events because if any of the speaker babble for about 50-60 seconds – and you will see the participants leaving the event. The lack of interaction can kill even the most exciting subject, & thus potentially a whole event. To make it more engaging, we can have Q&A sessions, quick polls or let them share their own ideas. </p>"
    },
    {
      "title": "Importance of Hashtags",
      "background": "https://cdn.pixabay.com/photo/2018/05/17/15/10/social-3408791_960_720.jpg",
      "highlight": "<p>Hashtags expand your reach outside your network, open ways of communication, get more engagement & increase brand recognition and awareness. They are a great way for people to search for topics on social networks that have a common theme.</p>",
      "text": "<p>Hashtags expand your reach outside your network, open ways of communication, get more engagement & increase brand recognition and awareness. They are a great way for people to search for topics on social networks that have a common theme. </p> <p>When used properly, they are an integral part of digital marketing. They can help campaign to go viral & take its own life beyond your current user base. You can follow specific hashtags to stay updated on a current topic/trend, you can create your own hashtag to promote a new product or service. </p> <p>Hashtags are very simple and effective. It’s easily create & searchable, & has become an extraordinary marketing tool for businesses, organisations, celebrities & even the average individual.</p> <p>We, at Eventlope have our own hashtag which is #letschangetheuptrendtogether by working on which we intend to change the trend of events in Uttar Pradesh. As the people of UP don’t give too much importance to events, therefore, we intend to change their mentality towards it & bring the trend of Delhi- Mumbai here in Lucknow. </p> <p>What happens in the metro cities: Events are organised every weekend & people in these cities search for them & take part in these events. So we are working with our young and dynamic team to bring the same trend in Lucknow. We are planning to organize the biggest concert in Lucknow which will help in taking our motive forward. </p> <p>We have another hashtag which is #letschangethetrendtogether by which we want to change the trend to events in India & we are planning to bring the events which are organised abroad here in India.</p>"
    },
    {
      "title": "Missing the pre-pandemic events & losses during pandemic",
      "background": "https://cdn.pixabay.com/photo/2015/06/08/15/11/typewriter-801921_960_720.jpg",
      "highlight": "<p>As the months have passed, social distancing and stay-at-home orders have grown stale to the point of feeling unbearable at times. Boredom set in weeks ago and the process of adjusting to the new normal seems like an ongoing process that many of us are still trying to master. </p>",
      "text": "<p> As the months have passed, social distancing and stay-at-home orders have grown stale to the point of feeling unbearable at times. Boredom set in weeks ago and the process of adjusting to the new normal seems like an ongoing process that many of us are still trying to master. Returning to work for many people is bittersweet because although we can (finally) leave our homes and return to some semblance of a routine, the vision of masks, gloves, repeated sanitizing, and six-feet apart warnings reminds us that life definitely does not look or feel the same.</p> <p>Missing Out - The gradual opening of nonessential services and businesses is considered a step forward for many people while others worry about the potential of setbacks and health consequences. As society cautiously tests the waters, there are still many events and activities that are on hold indefinitely. Most celebratory activities, holiday events, and large social gatherings that we once enjoyed and never believed could threaten public health, are among those that experts anticipate will be forbidden for at least the remainder of this year or longer. Many of us have already missed out on celebrating milestones in the way we are accustomed to and as the months go by, these missed milestones will likely touch all of our lives eventually. </p> <p>Realizing New Gains - As we process the changes to our everyday life, it’s important to also consider the many experiences, values, and growth opportunities we have gained. Alongside the missed milestones are so many lessons and insights that we’ve developed during the pandemic. Ask anyone, even those who seem to struggle the most with adapting to these changes, and they will tell you something highly valuable that they’ve learned throughout these past few months—their own, personal eye-opening experiences. </p> <p>Below we will review a few common experiences and events that have been taken from our everyday lives only to be replaced with many other strengths, attributes, and sources of gratitude. </p> <p>Missed Milestone/ New Experiences</p> <p>→Gained Insights, Realizations, & Experiences - Graduations at all stages, grades, and levels</p> <p>→A lesser focus on the symbolism of the celebration and a greater realization of the hard work involved and finding satisfaction in being proud of oneself for the accomplishment. - Birthday celebrations in large groups</p> <p>→Appreciation of close loved ones and more alone time to reflect on a new year, new goals, and new hopes for the future. - Public leisure/entertainment activities (e.g., restaurants, malls, movie theatres, bars) </p> <p>→Realizing how much focus we place on material things, how much money we spend on unnecessary items/activities, and how none of these things are important next to the health of ourselves and our loved ones. – Boredom</p> <p>→Discovering new ways to stay busy and getting involved in new hobbies and activities. Realizing how much we depend on the constant stimulation of going out and 'doing something'. - Staying at home, too long and too often. </p> <p>→Appreciating home life, family life, and realizing how much time we spend at work while missing out on spending time with our spouse/partner and/or children.- News updates on fatalities. </p> <p>→Gratitude for our health, increased awareness of not only personal safety, but our social duty to do what we can to maintain the safety of others, especially vulnerable populations. </p> <p>Realizing Even More</p> <p>There are so many eye-opening experiences that have resulted from the pandemic, staying at home, and being unable to gather socially. For all the moments and experiences we have missed out on, we have found that we have gained so much more. The virus has, in a sense, brought healing to so many of us through our increased gratitude, appreciation, and renewed sense of meaning in our lives. Continue this exercise by listing the things in your life that have come to a pause or may be aspects of your life that you have lost entirely and may never get back and then think of the many parts of yourself and your life that have grown and developed from your loss. </p>"
    },
    {
      "title": "What will be the New normal?",
      "background": "https://cdn.pixabay.com/photo/2020/09/17/10/54/education-5578742_960_720.png",
      "highlight": "<p>While people believe that virtual events will become the new normal, will a video interface ever be able to deliver the experience of face-to-face interactions? Most importantly, will the purpose of networking and brand visibility be fulfilled by these virtual events?</p>",
      "text": "<p>While people believe that virtual events will become the new normal, will a video interface ever be able to deliver the experience of face-to-face interactions? Most importantly, will the purpose of networking and brand visibility be fulfilled by these virtual events? It’s a hard thing to conclude; currently, most organizers are tied by their situations to resort to virtual, but some events work best with in-person participation, like sports and concerts. </p> <p>This, for sure, has given rise to a new buzzword in the events community, which is 'Hybrid'. As the term denotes, it’s a mix of virtual and in-person events—a webcast of an event that’s happening live somewhere. That sounds cool, right? It will surely increase the accessibility of the events and make it possible to attend virtually for those who cannot travel. But will all this lead to everyone appreciating the value of face-to-face events more than ever? Only time will tell. </p> <p>For now, we know there are tough times ahead, and we are confident that the incredibly resilient event industry will make it through them. We’ll work hard and smart and—most importantly—together to overcome the challenges ahead of us. If we do this, we’ll get back to the good times (or maybe better times) soon. </p><p>We hope that you are healthy and in good spirits. Stay safe. Stay strong. Stay positive!</p>"
    }
  ]
}
